## Plan Result (sbox-01-network)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.azurerm_route_table.route_table_appgw
  * module.network.azurerm_subnet_route_table_association.application_gateway_subnet
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.target_to_initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.azurerm_route_table.route_table_appgw will be created
  + resource "azurerm_route_table" "route_table_appgw" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "aks-sbox-appgw-route-table"
      + resource_group_name           = "ss-sbox-network-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.network.azurerm_subnet_route_table_association.application_gateway_subnet will be created
  + resource "azurerm_subnet_route_table_association" "application_gateway_subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-appgw"
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "sssbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + resource_group_name          = "ukw-hub-sbox-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ukw-hub-sbox-int"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":466,"Program":"tfcmt","SHA1":"","Target":"sbox-01-network","Vars":{}} -->